app/views/users/show.html.erb

<% user_stories = Story.where(user_id: current_user) %>
---
SELECT "stories".* FROM "stories" WHERE "stories"."user_id" = 2

  <% user_stories.each do |story| %>
    <% pages = story.pages.where(story_id: story.id) %>
---
SELECT  "pages".* FROM "pages" WHERE "pages"."story_id" = ? AND "pages"."story_id" = ?  ORDER BY "pages"."id" ASC LIMIT 1  [["story_id", 2], ["story_id", 2]]