app/controllers/stories_controller.rb

INSERT INTO "stories" ("name", "location", "travelStyle", "storyType", "user_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @story = current_user.stories.build(story_params)
    @story.user_id = current_user.id
    @story.status = "Draft"
    if @story.save

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "stories" SET "status" = ?, "updated_at" = ? WHERE "stories"."id" = ?  [["status", "Published"], ["updated_at", "2015-11-02 05:39:03.832485"], ["id", 2]]
---
  def update
    story = Story.find(params[:id])
    user = User.find(story.user_id)
    if story.status == 'Draft'
      story.update_attributes(:status => 'Published')

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "stories" WHERE "stories"."id" = ?  [["id", 3]]
---
  def destroy
    story = Story.find(params[:id])
    user = User.find(story.user_id)
    story.destroy

SELECT "pages".* FROM "pages" WHERE "pages"."story_id" = ?  [["story_id", 2]]
SELECT "text_elements".* FROM "text_elements" WHERE "text_elements"."page_id" = ?  [["page_id", 4]]
SELECT "image_elements".* FROM "image_elements" WHERE "image_elements"."page_id" = ?  [["page_id", 4]]
DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 9]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def done
    pages = Page.where(story_id: working_story.id)
    pages.each do |page|
      text_elements = TextElement.where(page_id: page.id)
      image_elements = ImageElement.where(page_id: page.id)
      if text_elements.length + image_elements.length == 0
        page.destroy
      end
    end
    user = User.find(working_story.user_id)